### Assignment 2

**Developer:** Ryan Parks

**Course**: Artificial Intelligence Applications

**Semester:** Summer 2024

**Program requirements (data analysis and visualization steps):**

1. Get
2. Clean
3. Prepare
4. Analyze
5. Display/Visualize (preparation)

In [2]:
import pandas as pd

### Get data

In [4]:
# Get mortality data
mortality_url = "https://data.cdc.gov/api/views/v6ab-adf5/rows.csv"

In [5]:
# Read cdv file to dataframe
mortality_data = pd.read_csv(mortality_url)

### Save DataFrame to pickle file

In [7]:
# Save DF to pickle file
mortality_data.to_pickle('mortality_data.pkl')

In [8]:
# Read pickle file
mortality_data = pd.read_pickle('mortality_data.pkl')

### (First - examine, then...), clean, prepare, analyze, and display data

In [10]:
# Print
print(mortality_data)

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
3    1903    1-4 Years      1542.1
4    1904    1-4 Years      1591.5
..    ...          ...         ...
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

In [11]:
# Print first 5 rows only
print(mortality_data.head())

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [12]:
# Print last 3 rows only
print(mortality_data.tail(3))

     Year    Age Group  Death Rate
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

In [13]:
# Display 6 rows with all cols
with pd.option_context(
    'display.max_rows', 6,
    'display.max_columns', None):
    print(mortality_data)

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
..    ...          ...         ...
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

### Display DataFrame attributes

In [15]:
# Print DF attributes
print("Index: ", mortality_data.index)
print("Columns: ", mortality_data.columns)
print("Size: ", mortality_data.size)
print("Shape: ", mortality_data.shape)

Index:  RangeIndex(start=0, stop=476, step=1)
Columns:  Index(['Year', 'Age Group', 'Death Rate'], dtype='object')
Size:  1428
Shape:  (476, 3)

In [16]:
# Display DF values in array format
print(mortality_data.values)

[[1900 '1-4 Years' 1983.8]
 [1901 '1-4 Years' 1695.0]
 [1902 '1-4 Years' 1655.7]
 ...
 [2016 '15-19 Years' 51.2]
 [2017 '15-19 Years' 51.5]
 [2018 '15-19 Years' 49.2]]

### Use columns attribute to change column names (i.e., remove any spaces)

In [18]:
# Use columns attribute and replace() function to remove spaces in column names
mortality_data.columns = mortality_data.columns.str.replace(" ", "")

In [19]:
# Print column names
print(mortality_data.columns)

Index(['Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [20]:
# Print column names with first 5 records
print(mortality_data.head())

   Year   AgeGroup  DeathRate
0  1900  1-4 Years     1983.8
1  1901  1-4 Years     1695.0
2  1902  1-4 Years     1655.7
3  1903  1-4 Years     1542.1
4  1904  1-4 Years     1591.5

### Use info(), nunique(), and describe() methods

In [22]:
# Print DF information
mortality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       476 non-null    int64
 1   AgeGroup   476 non-null    object
 2   DeathRate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

In [23]:
# Print DF information, including accurate memory usage
mortality_data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       476 non-null    int64
 1   AgeGroup   476 non-null    object
 2   DeathRate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 38.7 KB

In [24]:
# Summarize unique values in each column
mortality_data.nunique()

Year         119
AgeGroup       4
DeathRate    430
dtype: int64

In [25]:
# Display generic stats for each numeric column
mortality_data.describe()

              Year    DeathRate
count   476.000000   476.000000
mean   1959.000000   192.924160
std      34.387268   293.224216
min    1900.000000    11.400000
25%    1929.000000    40.575000
50%    1959.000000    89.500000
75%    1989.000000   222.575000
max    2018.000000  1983.800000

In [26]:
# Transpose stats so that stat names are displayed in columns
mortality_data.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,476.0,1959.00000,34.387268,1900.0,1929.000,1959.0,1989.000,2018.0
DeathRate,476.0,192.92416,293.224216,11.4,40.575,89.5,222.575,1983.8

In [27]:
# Save cleaned DF to pickle file
mortality_data.to_pickle('mortality_cleaned.pkl')

In [28]:
# Read cleaned pickle file to mortality_data variable
mortality_data = pd.read_pickle('mortality_cleaned.pkl')

In [29]:
# Display first 5 rows of cleaned pickle file
print(mortality_data.head())

   Year   AgeGroup  DeathRate
0  1900  1-4 Years     1983.8
1  1901  1-4 Years     1695.0
2  1902  1-4 Years     1655.7
3  1903  1-4 Years     1542.1
4  1904  1-4 Years     1591.5

### Accessing data (columns)

In [31]:
# Display first two records of DeathRate column using dot notation
print(mortality_data.DeathRate.head(2))

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [32]:
# Same as above using single brackets
print(mortality_data['DeathRate'].head(2))

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [33]:
# Same as above using double brackets
print(mortality_data[['DeathRate']].head(2))

   DeathRate
0     1983.8
1     1695.0

In [34]:
# Display DeathRate type using dot notation
print(type(mortality_data.DeathRate))

<class 'pandas.core.series.Series'>

In [35]:
# Display DeathRate type using single brackets
print(type(mortality_data['DeathRate']))

<class 'pandas.core.series.Series'>

In [36]:
# Display DeathRate type using double brackets
print(type(mortality_data[['DeathRate']]))

<class 'pandas.core.frame.DataFrame'>

In [37]:
# Access more than one column
print(mortality_data[['Year', 'DeathRate']].head(2))

   Year  DeathRate
0  1900     1983.8
1  1901     1695.0

In [38]:
# Display Year and DeathRate type using double brackets
type(mortality_data[['Year', 'DeathRate']])

pandas.core.frame.DataFrame

### Accessing rows

In [40]:
# Access data using query() function
print(mortality_data.query('Year==1900'))

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
119  1900    5-9 Years      466.1
238  1900  10-14 Years      298.3
357  1900  15-19 Years      484.8

In [41]:
# Access data using query() function
print(mortality_data.query('Year == 2000 and AgeGroup != "1-4 Years"'))

     Year     AgeGroup  DeathRate
219  2000    5-9 Years       15.8
338  2000  10-14 Years       20.3
457  2000  15-19 Years       67.1

In [42]:
# Access data using query() function, display first 5 records
print(mortality_data.query('Year == 1900 or Year == 2000').head())

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
100  2000    1-4 Years       32.4
119  1900    5-9 Years      466.1
219  2000    5-9 Years       15.8
238  1900  10-14 Years      298.3

### Access subset of rows and columns

In [44]:
# Using dot notation, access data using query() for DeathRate and display first 5 records
print(mortality_data.query('Year == 1900').DeathRate.head())

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [45]:
# Using single bracket notation, do same as above
print(mortality_data.query('Year == 1900')['DeathRate'].head())

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [46]:
# Using double bracket notation, do same as above
print(mortality_data.query('Year == 1900')[['DeathRate']].head())

     DeathRate
0       1983.8
119      466.1
238      298.3
357      484.8

In [47]:
# Display data type of dot notation used above
print(type(mortality_data.query('Year == 1900').DeathRate.head()))

<class 'pandas.core.series.Series'>

In [48]:
# Display data type of single bracket notation used above
print(type(mortality_data.query('Year == 1900')['DeathRate'].head()))

<class 'pandas.core.series.Series'>

In [49]:
# Display data type of double bracket notation used above
print(type(mortality_data.query('Year == 1900')[['DeathRate']].head()))

<class 'pandas.core.frame.DataFrame'>

In [50]:
# Using double bracket notation do same above
print(mortality_data.query('Year == 1900')[['AgeGroup', 'DeathRate']].head())

        AgeGroup  DeathRate
0      1-4 Years     1983.8
119    5-9 Years      466.1
238  10-14 Years      298.3
357  15-19 Years      484.8

### Access rows with loc[] accessor

In [52]:
# Display row values for 0, 5, and 10 index 'labels'
mortality_data.loc[[0,5,10]]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3

In [53]:
# Verify index 'labels' and row values
mortality_data.head(11)

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
1   1901  1-4 Years     1695.0
2   1902  1-4 Years     1655.7
3   1903  1-4 Years     1542.1
4   1904  1-4 Years     1591.5
5   1905  1-4 Years     1498.9
6   1906  1-4 Years     1580.0
7   1907  1-4 Years     1468.3
8   1908  1-4 Years     1396.8
9   1909  1-4 Years     1348.9
10  1910  1-4 Years     1397.3

In [54]:
# Access rows using *slice*
mortality_data.loc[4:6]

   Year   AgeGroup  DeathRate
4  1904  1-4 Years     1591.5
5  1905  1-4 Years     1498.9
6  1906  1-4 Years     1580.0

In [55]:
# Access rows using *slice*, include start, stop, and step values
mortality_data.loc[0:20:5]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3
15  1915  1-4 Years      924.2
20  1920  1-4 Years      987.2

In [56]:
# Access rows using conditional expression
mortality_data.loc[mortality_data.Year == 1917]

     Year     AgeGroup  DeathRate
17   1917    1-4 Years     1066.0
136  1917    5-9 Years      290.7
255  1917  10-14 Years      218.9
374  1917  15-19 Years      380.3

### Access rows and columns with loc[] accessor

In [58]:
# Display first and last 5 rows, of Year and AgeGroup columns
mortality_data.loc[:, ['Year', 'AgeGroup']]

     Year     AgeGroup
0    1900    1-4 Years
1    1901    1-4 Years
2    1902    1-4 Years
3    1903    1-4 Years
4    1904    1-4 Years
..    ...          ...
471  2014  15-19 Years
472  2015  15-19 Years
473  2016  15-19 Years
474  2017  15-19 Years
475  2018  15-19 Years

[476 rows x 2 columns]

### Access subset of rows and columns with loc[] accessor

In [60]:
# Using loc[] accessor with lists for row and column labels, display row values for 0, 5, and 10 index 'labels'
mortality_data.loc[[0,5,10],['AgeGroup', 'DeathRate']]

     AgeGroup  DeathRate
0   1-4 Years     1983.8
5   1-4 Years     1498.9
10  1-4 Years     1397.3

In [61]:
# Here, using slices of rows and column labels
mortality_data.loc[4:6, 'AgeGroup': 'DeathRate']

    AgeGroup  DeathRate
4  1-4 Years     1591.5
5  1-4 Years     1498.9
6  1-4 Years     1580.0

### Access rows with iloc[] accessor

In [63]:
# Display first, sixth, and 11th rows
mortality_data.iloc[[0,5,10]]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3

In [64]:
# Verify index 'positions' and row values
mortality_data.head(11)

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
1   1901  1-4 Years     1695.0
2   1902  1-4 Years     1655.7
3   1903  1-4 Years     1542.1
4   1904  1-4 Years     1591.5
5   1905  1-4 Years     1498.9
6   1906  1-4 Years     1580.0
7   1907  1-4 Years     1468.3
8   1908  1-4 Years     1396.8
9   1909  1-4 Years     1348.9
10  1910  1-4 Years     1397.3

In [65]:
# Access rows using *slice*
mortality_data.iloc[4:6]

   Year   AgeGroup  DeathRate
4  1904  1-4 Years     1591.5
5  1905  1-4 Years     1498.9

In [66]:
# Access rows using *slice*, include start, stop, and step values
mortality_data.iloc[0:20:5]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3
15  1915  1-4 Years      924.2

### Access subset of rows and columns with iloc[] accessor -- can use negative values

In [68]:
# Display rows and columns using index positions and lists
mortality_data.iloc[[0,5,10],[1,2]]

     AgeGroup  DeathRate
0   1-4 Years     1983.8
5   1-4 Years     1498.9
10  1-4 Years     1397.3

In [69]:
# Display rows and columns using index positions and slices
mortality_data.iloc[4:7,1:3]

    AgeGroup  DeathRate
4  1-4 Years     1591.5
5  1-4 Years     1498.9
6  1-4 Years     1580.0

In [70]:
# Use iloc[] accessor with negative values
mortality_data.iloc[-10:]

     Year     AgeGroup  DeathRate
466  2009  15-19 Years       51.9
467  2010  15-19 Years       49.4
468  2011  15-19 Years       48.9
469  2012  15-19 Years       47.2
470  2013  15-19 Years       44.8
471  2014  15-19 Years       45.5
472  2015  15-19 Years       48.3
473  2016  15-19 Years       51.2
474  2017  15-19 Years       51.5
475  2018  15-19 Years       49.2